app/Controllers/Admin.php

    public function index()
    {
        $congeModel = new CongeModel();
        $employeModel = new EmployeModel();

        $currentMonth = date('m');
        $currentYear = date('Y');

        $absencesMois = $congeModel->select('conges.*, employes.nom, employes.prenom, types_conge.libelle')
                                  ->join('employes', 'employes.id = conges.employe_id')
                                  ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                                  ->where('conges.statut', 'approuvee')
                                  ->groupStart()
                                    ->where("strftime('%m', date_debut) = '$currentMonth' OR strftime('%m', date_fin) = '$currentMonth'")
                                  ->groupEnd()
                                  ->findAll();

        $data = [
            'title'         => 'Dashboard Admin',
            'totalEmployes' => $employeModel->countAll(),
            'demandesAttente' => $congeModel->where('statut', 'en_attente')->countAllResults(),
            'absencesMois'  => $absencesMois
        ];
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'approuvee'
AND   (
strftime('%m', date_debut) = '05' OR strftime('%m', date_fin) = '05'
 )
SELECT strftime('%m', date_debut) as mois, SUM(nb_jours) as total
FROM `conges`
WHERE strftime('%Y', date_debut) = '2026'
AND `statut` = 'approuvee'
GROUP BY `mois`
ORDER BY `mois` ASC
SELECT COUNT(*) AS `numrows` FROM `employes`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'

    public function listHistorique()
    {
        $congeModel = new CongeModel();
        $depModel = new DepartementModel();

        // Filtres
        $statut = $this->request->getGet('statut');
        $departementId = $this->request->getGet('departement_id');

        $query = $congeModel->select('conges.*, employes.nom, employes.prenom, employes.departement_id, types_conge.libelle')
                            ->join('employes', 'employes.id = conges.employe_id')
                            ->join('types_conge', 'types_conge.id = conges.type_conge_id');

        if (!empty($statut) && $statut !== 'all') {
            $query->where('conges.statut', $statut);
        }

        if (!empty($departementId)) {
            $query->where('employes.departement_id', $departementId);
        }

        $data = [
            'title'         => 'Historique des demandes',
            'demandes'      => $query->orderBy('conges.created_at', 'DESC')->findAll(),
            'departements'  => $depModel->findAll(),
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `types_conge`.`libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
ORDER BY `conges`.`created_at` DESC
SELECT *
FROM `departements`

    public function listDepartements()
    {
        $model = new DepartementModel();
        $data = [
            'title'        => 'Gestion des Départements',
            'departements' => $model->findAll()
---
SELECT *
FROM `departements`

    public function listSoldes()
    {
        $soldeModel = new SoldeModel();
        $employeModel = new EmployeModel();
        $typeModel = new TypeCongeModel();

        $soldes = $soldeModel->select('soldes.*, employes.nom as emp_nom, employes.prenom as emp_prenom, types_conge.libelle as type_libelle')
                             ->join('employes', 'employes.id = soldes.employe_id')
                             ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
                             ->orderBy('employes.nom', 'ASC')
                             ->findAll();

        $data = [
            'title'         => 'Gestion des Soldes',
            'soldes'        => $soldes,
            'employes'      => $employeModel->findAll(),
            'typesConge'    => $typeModel->findAll(),
            'currentYear'   => date('Y')
        ];
---
SELECT `soldes`.*, `employes`.`nom` as `emp_nom`, `employes`.`prenom` as `emp_prenom`, `types_conge`.`libelle` as `type_libelle`
FROM `soldes`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
ORDER BY `employes`.`nom` ASC
SELECT *
FROM `types_conge`
SELECT *
FROM `employes`