app/Controllers/Admin.php

        }

        // 2. Congés par jour de la semaine (année en cours) - Ventilation réelle
        $statsJoursRaw = $congeModel->where("strftime('%Y', date_debut)", $currentYear)
                                    ->where('statut', 'approuvee')
                                    ->findAll();
---
SELECT strftime('%w', date_debut) as jour, SUM(nb_jours) as total
FROM `conges`
WHERE strftime('%Y', date_debut) = '2026'
AND `statut` = 'approuvee'
GROUP BY `jour`
ORDER BY `jour` ASC

            $dataJours[1], $dataJours[2], $dataJours[3], $dataJours[4], $dataJours[5], $dataJours[6], $dataJours[0]
        ];

        $data = [
            'title'         => 'Dashboard Admin',
            'totalEmployes' => $employeModel->countAll(),
            'demandesAttente' => $congeModel->where('statut', 'en_attente')->countAllResults(),
            'absencesMois'  => $absencesMois,
            'chartMois'     => array_values($dataMois),
            'chartJours'    => $reorderedJours
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows` FROM `employes`