app/Controllers/Auth.php

    public function attemptLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new EmployeModel();
        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'jean.dupont@techmada.mg'
 LIMIT 1