app/Controllers/Employe.php

SELECT *
FROM `conges`
WHERE `employe_id` = 3
AND `statut` IN ('en_attente','approuvee')
AND   (
`date_debut` <= '2026-06-02'
AND `date_fin` >= '2026-05-29'
 )
 LIMIT 1
---
        }

        $congeModel = new CongeModel();
        $chevauchement = $congeModel->where('employe_id', $employeId)
                                    ->whereIn('statut', ['en_attente', 'approuvee'])
                                    ->groupStart()
                                        ->where('date_debut <=', $dateFin)
                                        ->where('date_fin >=', $dateDebut)
                                    ->groupEnd()
                                    ->first();