app/Controllers/Employe.php

SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 3
ORDER BY `created_at` DESC
 LIMIT 5
SELECT `soldes`.*, `types_conge`.`libelle`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `employe_id` = 3
AND `annee` = '2026'
---
    public function index()
    {
        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();

        $employeId = session()->get('id');
        $currentYear = date('Y');

        $data = [
            'title'      => 'Tableau de bord - Employé',
            'lastConges' => $congeModel->select('conges.*, types_conge.libelle as type_libelle')
                                      ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                                      ->where('employe_id', $employeId)
                                      ->orderBy('created_at', 'DESC')
                                      ->limit(5)
                                      ->findAll(),
            'soldes'     => $soldeModel->select('soldes.*, types_conge.libelle')
                                      ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
                                      ->where('employe_id', $employeId)
                                      ->where('annee', $currentYear)
                                      ->findAll()

SELECT `soldes`.*, `types_conge`.`libelle`
FROM `soldes`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
WHERE `employe_id` = 3
AND `annee` = '2026'
---
    public function conges()
    {
        $congeModel = new CongeModel();
        $typeModel = new TypeCongeModel();
        $soldeModel = new SoldeModel();

        $employeId = session()->get('id');
        $currentYear = date('Y');

        $data = [
            'title'      => 'Mes Congés',
            'conges'     => $congeModel->getEmployeConges($employeId),
            'types'      => $typeModel->findAll(),
            'soldes'     => $soldeModel->select('soldes.*, types_conge.libelle')
                                      ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
                                      ->where('employe_id', $employeId)
                                      ->where('annee', $currentYear)
                                      ->findAll()

SELECT *
FROM `employes`
WHERE `employes`.`id` = 3
SELECT *
FROM `departements`
---
    public function profil()
    {
        $employeModel = new \App\Models\EmployeModel();
        $employeId = session()->get('id');
        $employe = $employeModel->find($employeId);

        $depModel = new \App\Models\DepartementModel();
        $data = [
            'title'        => 'Mon Profil',
            'employe'      => $employe,
            'departements' => $depModel->findAll()
        ];