app/Controllers/Employe.php

SELECT *
FROM `departements`
---
    public function profil()
    {
        $employeModel = new \App\Models\EmployeModel();
        $employeId = session()->get('id');
        $employe = $employeModel->find($employeId);

        $depModel = new \App\Models\DepartementModel();
        $data = [
            'title'        => 'Mon Profil',
            'employe'      => $employe,
            'departements' => $depModel->findAll()