app/Controllers/RH.php

    public function demandes()
    {
        $congeModel = new CongeModel();

        $data = [
            'title'    => 'Demandes à traiter',
            'demandes' => $congeModel->select('conges.*, employes.nom, employes.prenom, types_conge.libelle')
                                    ->join('employes', 'employes.id = conges.employe_id')
                                    ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                                    ->where('conges.statut', 'en_attente')
                                    ->findAll()
---
SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'

    public function traiter()
    {
        $id = $this->request->getPost('id');
        $action = $this->request->getPost('action'); // approuvee | refusee
        $commentaire = $this->request->getPost('commentaire_rh');

        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();

        $conge = $congeModel->find($id);
---
SELECT *
FROM `conges`
WHERE `conges`.`id` = '1'

            }

            // Mettre à jour le solde
            $soldeModel->update($solde['id'], [
                'jours_pris' => $solde['jours_pris'] + $nbJours
            ]);
        }

        $congeModel->update($id, [
            'statut'         => $action,
            'commentaire_rh' => $commentaire,
            'traite_par'     => session()->get('id')
        ]);
---
UPDATE `soldes` SET `jours_pris` = 9
WHERE `soldes`.`id` IN ('7')
UPDATE `conges` SET `statut` = 'approuvee', `commentaire_rh` = 'Test approuvé', `traite_par` = '2'
WHERE `conges`.`id` IN ('1')