app/Controllers/RH.php

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `employes`.`departement_id`, `types_conge`.`libelle`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
ORDER BY `conges`.`created_at` DESC
SELECT *
FROM `departements`
---
    public function demandes()
    {
        $congeModel = new CongeModel();
        $depModel = new DepartementModel();

        // Filtres
        $statut = $this->request->getGet('statut') ?? 'en_attente';
        $departementId = $this->request->getGet('departement_id');

        $query = $congeModel->select('conges.*, employes.nom, employes.prenom, employes.departement_id, types_conge.libelle')
                            ->join('employes', 'employes.id = conges.employe_id')
                            ->join('types_conge', 'types_conge.id = conges.type_conge_id');

        if ($statut !== 'all') {
            $query->where('conges.statut', $statut);
        }

        if (!empty($departementId)) {
            $query->where('employes.departement_id', $departementId);
        }

        $data = [
            'title'         => 'Demandes à traiter',
            'demandes'      => $query->orderBy('conges.created_at', 'DESC')->findAll(),
            'departements'  => $depModel->findAll(),

SELECT *
FROM `conges`
WHERE `conges`.`id` = '3'
SELECT *
FROM `soldes`
WHERE `employe_id` = 3
AND `type_conge_id` = 1
AND `annee` = '2026'
 LIMIT 1
---
    public function traiter()
    {
        $id = $this->request->getPost('id');
        $action = $this->request->getPost('action'); // approuvee | refusee
        $commentaire = $this->request->getPost('commentaire_rh');

        $congeModel = new CongeModel();
        $soldeModel = new SoldeModel();

        $conge = $congeModel->find($id);
        if (!$conge) {
            return redirect()->back()->with('error', 'Demande introuvable.');
        }

        $oldStatus = $conge['statut'];
        $employeId = $conge['employe_id'];
        $typeCongeId = $conge['type_conge_id'];
        $nbJours = $conge['nb_jours'];
        $annee = date('Y', strtotime($conge['date_debut']));

        // Trouver le solde
        $solde = $soldeModel->where([
            'employe_id'    => $employeId,
            'type_conge_id' => $typeCongeId,
            'annee'         => $annee
        ])->first();

UPDATE `soldes` SET `jours_pris` = 24
WHERE `soldes`.`id` IN (7)
---
            if ($solde['jours_pris'] + $nbJours > $solde['jours_attribues']) {
                return redirect()->back()->with('error', 'Solde insuffisant pour approuver cette demande.');
            }
            $soldeModel->update($solde['id'], ['jours_pris' => $solde['jours_pris'] + $nbJours]);

UPDATE `conges` SET `statut` = 'approuvee', `commentaire_rh` = '', `traite_par` = 2
WHERE `conges`.`id` IN ('3')
---
            $soldeModel->update($solde['id'], ['jours_pris' => $solde['jours_pris'] - $nbJours]);
        }

        $congeModel->update($id, [
            'statut'         => $action,
            'commentaire_rh' => $commentaire,
            'traite_par'     => session()->get('id')
        ]);

SELECT `soldes`.*, `employes`.`nom` as `emp_nom`, `employes`.`prenom` as `emp_prenom`, `employes`.`departement_id`, `types_conge`.`libelle` as `type_libelle`
FROM `soldes`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`
ORDER BY `employes`.`nom` ASC
SELECT *
FROM `departements`
---
    public function soldes()
    {
        $soldeModel = new SoldeModel();
        $employeModel = new EmployeModel();
        $depModel = new DepartementModel();

        $departementId = $this->request->getGet('departement_id');

        $query = $soldeModel->select('soldes.*, employes.nom as emp_nom, employes.prenom as emp_prenom, employes.departement_id, types_conge.libelle as type_libelle')
                            ->join('employes', 'employes.id = soldes.employe_id')
                            ->join('types_conge', 'types_conge.id = soldes.type_conge_id');

        if (!empty($departementId)) {
            $query->where('employes.departement_id', $departementId);
        }

        $data = [
            'title'        => 'Soldes des employés',
            'soldes'       => $query->orderBy('employes.nom', 'ASC')->findAll(),
            'departements' => $depModel->findAll(),