app/Models/CongeModel.php

SELECT `conges`.*, `types_conge`.`libelle` as `type_libelle`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 3
ORDER BY `created_at` DESC
---
    public function getEmployeConges($employeId)
    {
        return $this->select('conges.*, types_conge.libelle as type_libelle')
                    ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                    ->where('employe_id', $employeId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();