app/Models/SoldeModel.php

SELECT *
FROM `soldes`
WHERE `employe_id` = 3
AND `type_conge_id` = 2
AND `annee` = '2026'
 LIMIT 1
---
    public function getRestant($employeId, $typeCongeId, $annee)
    {
        $solde = $this->where([
            'employe_id'    => $employeId,
            'type_conge_id' => $typeCongeId,
            'annee'         => $annee
        ])->first();